zhanglazhuan/NomadCast/debug/t_ui/sdkconfig.defaults
# Target chip (must be set before first build)
CONFIG_IDF_TARGET="esp32s3"

# Increase main task stack for LVGL rendering (default 3584 → 8192)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# USB Serial/JTAG as console (Leisound V1 doesn't use UART0)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Leisound V1 has 16MB flash + 8MB PSRAM (ESP32-S3 WROOM N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# FATFS (pulled in by default; configure to avoid build errors)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_TIMEOUT_MS=10000
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FATFS_USE_LABEL=y

# ADF audio board — use "Custom audio board" (avoids Lyrat V4.3 default)
CONFIG_AUDIO_BOARD_CUSTOM=y

# FreeRTOS backward compat (required by ADF components)
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Partition table — single app
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# LVGL 9.5 configuration
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_MEM_SIZE=65536
CONFIG_LV_MEMCPY_MEMSET_STD=y
